## Data Preprocessing (Missing Data, Encoding, Scaling, Splitting)

In [1]:
import pandas as pd

In [2]:
dic_data = {'Name':['Ali' , 'Umer' , 'Aatif' , 'Ayan'],
            'Age':[22 , None , 31 , None],
            'Salary':[120000 , 100000 , None , None]}
df = pd.DataFrame(dic_data)
print('Original DataFrame')
df

Original DataFrame

    Name   Age    Salary
0    Ali  22.0  120000.0
1   Umer   NaN  100000.0
2  Aatif  31.0       NaN
3   Ayan   NaN       NaN

In [3]:
df.isnull().mean()  #kitnay % data missing ha column main ye btata ha

Name      0.0
Age       0.5
Salary    0.5
dtype: float64

In [4]:
print(df.isnull().sum())

Name      0
Age       2
Salary    2
dtype: int64

In [5]:
df_drop = df.dropna()
df_drop

  Name   Age    Salary
0  Ali  22.0  120000.0

In [6]:
df['Age'].fillna(df['Age'].mean() , inplace=True)
df['Salary'].fillna(df['Salary'].mean() , inplace=True)
df

    Name   Age    Salary
0    Ali  22.0  120000.0
1   Umer  26.5  100000.0
2  Aatif  31.0  110000.0
3   Ayan  26.5  110000.0

In [ ]:
# # PRACTICE 
dic_data = {'Name':['Ali' , 'Umer' , 'Aatif' , 'Ayan'],
            'Age':[22 , None , 31 , None],
            'Salary':[120000 , 100000 , None , None]}
df = pd.DataFrame(dic_data)
print('Original DataFrame')
print(df) 

# isnull().sum()
print(f'Count NaN values from all feaures\n{df.isnull().sum()}')
print(df.isnull().mean())

# fillna() 
df['Age'] = df['Age'].fillna(df['Age'].mean())
print(f'Age --> Fill NaN Values\n{df}')

df['Salary'] = df['Salary'].fillna(df['Salary'].mean())
print(f'Salary --> Fill NaN Values\n{df}')

# dropna() 
fresh_copy = dic_data.copy()
df = pd.DataFrame(fresh_copy)
drop_null_rows = df.dropna()
drop_null_rows

Original DataFrame
    Name   Age    Salary
0    Ali  22.0  120000.0
1   Umer   NaN  100000.0
2  Aatif  31.0       NaN
3   Ayan   NaN       NaN
Count NaN values from all feaures
Name      0
Age       2
Salary    2
dtype: int64
Name      0.0
Age       0.5
Salary    0.5
dtype: float64
Age --> Fill NaN Values
    Name   Age    Salary
0    Ali  22.0  120000.0
1   Umer  26.5  100000.0
2  Aatif  31.0       NaN
3   Ayan  26.5       NaN
Salary --> Fill NaN Values
    Name   Age    Salary
0    Ali  22.0  120000.0
1   Umer  26.5  100000.0
2  Aatif  31.0  110000.0
3   Ayan  26.5  110000.0

  Name   Age    Salary
0  Ali  22.0  120000.0

# Label Encoded

In [8]:
# Import Lib 
from sklearn.preprocessing import LabelEncoder
import pandas as pd

In [9]:
# Create Data 
data = {'Name':['Ali' , 'Usman' , 'Farooq' , 'Zahid' , 'Zohaib' , 'Aaliya' , 'Sadaf' , 'Hania'],
        'Age':[24 , 29 , 33 , 39 , 39.5 , 20 , 22 , 26],
        'Gender':['Male' , 'Male' , 'Male' , 'Male' , 'Male' , 'Female' , 'Female' , 'Female']}

df = pd.DataFrame(data)
df

     Name   Age  Gender
0     Ali  24.0    Male
1   Usman  29.0    Male
2  Farooq  33.0    Male
3   Zahid  39.0    Male
4  Zohaib  39.5    Male
5  Aaliya  20.0  Female
6   Sadaf  22.0  Female
7   Hania  26.0  Female

In [10]:
# above DataFrame convert to CSV FILE   
df.to_csv('BeforeEncoded.csv')

In [11]:
call_csv = pd.read_csv('BeforeEncoded.csv' , index_col=[0])
call_csv

     Name   Age  Gender
0     Ali  24.0    Male
1   Usman  29.0    Male
2  Farooq  33.0    Male
3   Zahid  39.0    Male
4  Zohaib  39.5    Male
5  Aaliya  20.0  Female
6   Sadaf  22.0  Female
7   Hania  26.0  Female

In [12]:
df_label = call_csv.copy()

In [13]:
le = LabelEncoder()

In [14]:
# set new column 
df_label['Gender_encoded'] = le.fit_transform(df_label['Gender'])
print('Label Encoded')
df_label

Label Encoded

     Name   Age  Gender  Gender_encoded
0     Ali  24.0    Male               1
1   Usman  29.0    Male               1
2  Farooq  33.0    Male               1
3   Zahid  39.0    Male               1
4  Zohaib  39.5    Male               1
5  Aaliya  20.0  Female               0
6   Sadaf  22.0  Female               0
7   Hania  26.0  Female               0

In [15]:
# Practice
from sklearn.preprocessing import LabelEncoder
import pandas as pd
df = pd.read_csv('BeforeEncoded.csv' , index_col=[0])
freash_copy_csv = df.copy()
label_encoded = LabelEncoder()
freash_copy_csv['GenderEncoded'] = label_encoded.fit_transform(freash_copy_csv['Gender'])
print('Label Encoded')
freash_copy_csv

Label Encoded

     Name   Age  Gender  GenderEncoded
0     Ali  24.0    Male              1
1   Usman  29.0    Male              1
2  Farooq  33.0    Male              1
3   Zahid  39.0    Male              1
4  Zohaib  39.5    Male              1
5  Aaliya  20.0  Female              0
6   Sadaf  22.0  Female              0
7   Hania  26.0  Female              0

In [16]:
# practice 2nd time 
from sklearn.preprocessing import LabelEncoder
import pandas as pd
df = pd.read_csv('BeforeEncoded.csv' , index_col=[0])
freash_copy_csv = df.copy()
le = LabelEncoder()
freash_copy_csv['GenderEncoder'] = le.fit_transform(freash_copy_csv['Gender'])
print('After Encoded')
freash_copy_csv

After Encoded

     Name   Age  Gender  GenderEncoder
0     Ali  24.0    Male              1
1   Usman  29.0    Male              1
2  Farooq  33.0    Male              1
3   Zahid  39.0    Male              1
4  Zohaib  39.5    Male              1
5  Aaliya  20.0  Female              0
6   Sadaf  22.0  Female              0
7   Hania  26.0  Female              0

In [17]:
# PRACTICE 3RD TIMES
from sklearn.preprocessing import LabelEncoder
import pandas as pd
df = pd.read_csv('BeforeEncoded.csv' , index_col=[0])
freash_copy_csv = df.copy()
freash_copy_csv['GenderEncoder'] = LabelEncoder().fit_transform(freash_copy_csv['Gender'])
print('AFTER ENCODED')
freash_copy_csv

AFTER ENCODED

     Name   Age  Gender  GenderEncoder
0     Ali  24.0    Male              1
1   Usman  29.0    Male              1
2  Farooq  33.0    Male              1
3   Zahid  39.0    Male              1
4  Zohaib  39.5    Male              1
5  Aaliya  20.0  Female              0
6   Sadaf  22.0  Female              0
7   Hania  26.0  Female              0

### One hot encoded
### Use --> get_dummies

In [18]:
data = {
    "Name": ["Ali", "Sara", "Ahmed", "Ayesha"],
    "Gender": ["Male", "Female", "Male", "Female"],
    "City": ["Lahore", "Karachi", "Lahore", "Islamabad"]
}

df = pd.DataFrame(data)
print(df)

     Name  Gender       City
0     Ali    Male     Lahore
1    Sara  Female    Karachi
2   Ahmed    Male     Lahore
3  Ayesha  Female  Islamabad

In [19]:
df_encoded = pd.get_dummies(df , columns=['City'])
df_encoded

     Name  Gender  City_Islamabad  City_Karachi  City_Lahore
0     Ali    Male           False         False         True
1    Sara  Female           False          True        False
2   Ahmed    Male           False         False         True
3  Ayesha  Female            True         False        False

## Feature Scalling

In [ ]:
# syntax:
from sklearn.preprocessing import StandardScaler , MinMaxScaler
scalar = StandardScaler()
X_scaled = scalar.fit_transform()

scalar = MinMaxScaler()
X_scaled = scalar.fit_transform()

In [33]:
import pandas as pd
from sklearn.preprocessing import StandardScaler , MinMaxScaler
from sklearn.model_selection import train_test_split

data = {
    'StudyHours':[1,2,3,4,5],
    'TestScore':[40,50,60,70,80]
}
df = pd.DataFrame(data)

standard_scaler = StandardScaler()
standard_scaled = standard_scaler.fit_transform(df)

print('Standard Scalar Output')
# numpy array convert to DataFrame
print(pd.DataFrame(standard_scaled , columns=['StudyHours' , 'TestScore']))

min_max_scaler = MinMaxScaler()
min_max_scaled = min_max_scaler.fit_transform(df)

print('\nMinMax Scaled Output')
print(pd.DataFrame(min_max_scaled , columns=['StudyHours' , 'TestScore']))

Standard Scalar Output
   StudyHours  TestScore
0   -1.414214  -1.414214
1   -0.707107  -0.707107
2    0.000000   0.000000
3    0.707107   0.707107
4    1.414214   1.414214

MinMax Scaled Output
   StudyHours  TestScore
0        0.00       0.00
1        0.25       0.25
2        0.50       0.50
3        0.75       0.75
4        1.00       1.00

## Split

In [37]:
X = df[['StudyHours']]
y = df['TestScore']

X_train , X_test , y_train , y_test = train_test_split(X , y , test_size=0.2 , random_state=42)
print('Training Data')
print(X_train)

print('Testing Data')
print(X_test)

print('Training Data')
print(y_train)

print('Testing Data')
print(y_test)

Training Data
   StudyHours
4           5
2           3
0           1
3           4
Testing Data
   StudyHours
1           2
Training Data
4    80
2    60
0    40
3    70
Name: TestScore, dtype: int64
Testing Data
1    50
Name: TestScore, dtype: int64